app/views/contacts/show.html.erb

<button class="glyphicon glyphicon-plus Transparent" style="color: DodgerBlue;"  data-toggle="modal" data-target="#newCallModal"></button></h4>
<% if @contact.calls.blank? %>
---
SELECT "calls".* FROM "calls" WHERE "calls"."contact_id" = $1  [["contact_id", 3]]

<% else %>
	<% @contact.calls.each do |call| %>
---
SELECT "calls".* FROM "calls" WHERE "calls"."contact_id" = $1  [["contact_id", 1]]