app/controllers/calls_controller.rb

	def create
		@contact = Contact.find(params[:contact_id])
		@call = @contact.calls.create(call_params)
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "calls" ("description", "date_time", "rank", "contact_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "Not bad"], ["date_time", "1397-12-10 00:00:00"], ["rank", 5], ["contact_id", 2], ["created_at", "2018-10-04 08:10:59.750744"], ["updated_at", "2018-10-04 08:10:59.750744"]]

	def destroy
		@contact = Contact.find(params[:contact_id])
		@call = Call.find(params[:id])
		@call.destroy
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "calls".* FROM "calls" WHERE "calls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "calls" WHERE "calls"."id" = $1  [["id", 1]]

	def update
		@contact = Contact.find(params[:contact_id])
		@call = Call.find(params[:id])
		@call.update(call_params)
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "calls".* FROM "calls" WHERE "calls"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "calls" SET "description" = $1, "updated_at" = $2 WHERE "calls"."id" = $3  [["description", "تماس اول خوب بود یعنی بد نبود."], ["updated_at", "2018-10-13 17:01:38.550163"], ["id", 12]]