app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts"
---
	def index
		@contact = Contact.new
		@contacts = Contact.all

INSERT INTO "contacts" ("first_name", "last_name", "mobile_number", "address", "created_at", "updated_at", "phone_number") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		@contact = Contact.new(contact_params)
		if @contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@contact = Contact.find(params[:id])

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "contacts" SET "address" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["address", "یزد- خیابان دوم"], ["updated_at", "2018-10-08 10:59:44.766674"], ["id", 4]]
---
	def update
		@contact = Contact.find(params[:id])

		if @contact.update(contact_params)

SELECT "contacts".* FROM "contacts" WHERE (first_name = '%%' or last_name = '%%' or phone_number = '%%' or mobile_number = '%%' or address LIKE '%تهران%')
---
	def results
		if params[:subject][:name].present?
			where_statement = "first_name LIKE ? or last_name LIKE ?"
		else
			where_statement = "first_name = ? or last_name = ?"
		end
		if params[:subject][:number].present?
			where_statement = where_statement + " or phone_number LIKE ? or mobile_number LIKE ?"
		else
			where_statement = where_statement + " or phone_number = ? or mobile_number = ?"
		end
		if params[:subject][:address].present?
			where_statement = where_statement + " or address LIKE ?"
		else
			where_statement = where_statement + " or address = ?"
		end

		@contacts = Contact.where(where_statement, "%#{params[:subject][:name]}%", "%#{params[:subject][:name]}%", "%#{params[:subject][:number]}%", "%#{params[:subject][:number]}%", "%#{params[:subject][:address]}%" ).load

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 1]]
---
	def destroy
		@contact = Contact.find(params[:id])
		@contact.destroy