app/controllers/users_controller.rb

	def index
		@user = User.new
		@users = User.all
---
SELECT "users".* FROM "users"

	def update
		@user = User.find(params[:id])

		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$11$S582iN9SVkSzaLU8R7vrJ.BH3mkdl6wnlVvp3HB14aPP6qBQNcKdW"], ["updated_at", "2018-10-12 17:44:41.172114"], ["id", 1]]

	def create
		@user = User.create(user_params)
		if @user.save
			redirect_to users_path
		else
			@users = User.all
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT "users".* FROM "users"

	def results
		@users = User.where("email LIKE ?", "%#{params[:user][:email]}%").load
---
SELECT "users".* FROM "users" WHERE (email LIKE '%m%')

	def active_user
		@user = User.find(params[:id])
		@user.update_attributes(user_type: 2)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "user_type" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_type", 2], ["updated_at", "2018-10-10 11:53:44.727024"], ["id", 4]]

	def de_active_user
		@user = User.find(params[:id])
		@user.update_attributes(user_type: 3)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "user_type" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_type", 3], ["updated_at", "2018-10-10 11:53:06.277127"], ["id", 5]]